**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [2]:
import numpy as np
import pandas as pd
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers',
                  'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

In [3]:
df=pd.DataFrame.from_dict(data)
lab = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
lab = pd.DataFrame.from_dict(lab)
df['labels'] = lab
df = df.set_index('labels')
print(df)

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f           Cranes  3.0       4       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no

In [5]:
df_bird=pd.DataFrame(df['birds'])
df_bird

             birds
labels
a           Cranes
b           Cranes
c          plovers
d       spoonbills
e       spoonbills
f           Cranes
g          plovers
h           Cranes
i       spoonbills
j       spoonbills

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [6]:
# df_bird.describe()
df_bird.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   birds   10 non-null     object
dtypes: object(1)
memory usage: 160.0+ bytes

**3. Print the first 2 rows of the birds dataframe **

In [7]:
df_bird[0:2]

         birds
labels
a       Cranes
b       Cranes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [9]:
df_both=pd.DataFrame(df)
df_both[['birds','age']]

             birds  age
labels
a           Cranes  3.5
b           Cranes  4.0
c          plovers  1.5
d       spoonbills  NaN
e       spoonbills  6.0
f           Cranes  3.0
g          plovers  5.5
h           Cranes  NaN
i       spoonbills  8.0
j       spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [10]:
df=pd.DataFrame(df)
df[['birds','age','visits']].iloc[[1,2,3]]

             birds  age  visits
labels
b           Cranes  4.0       4
c          plovers  1.5       3
d       spoonbills  NaN       4

**6. select the rows where the number of visits is less than 4**

In [11]:
print(df)
df[df['visits']<4]

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f           Cranes  3.0       4       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
c          plovers  1.5       3       no
e       spoonbills  6.0       3       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [12]:
df[df.isnull().any(axis=1)]

             birds  age  visits priority
labels
d       spoonbills  NaN       4      yes
h           Cranes  NaN       2      yes

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [13]:
print(df[(df['birds']=='Cranes')])
df[(df['birds']=='Cranes') & (df['age']<4)]

         birds  age  visits priority
labels
a       Cranes  3.5       2      yes
b       Cranes  4.0       4      yes
f       Cranes  3.0       4       no
h       Cranes  NaN       2      yes

         birds  age  visits priority
labels
a       Cranes  3.5       2      yes
f       Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [14]:
df[(df['age']>=2) &(df['age']<=4)]

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
f           Cranes  3.0       4       no
j       spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [15]:
x=df[(df['birds']=='Cranes') ]
x['visits'].sum()

12

**11. Calculate the mean age for each different birds in dataframe.**

In [16]:
a=df.groupby('birds')
for bird,BIRD1 in a:
    print(bird,":",BIRD1['age'].mean())

Cranes : 3.5
plovers : 3.5
spoonbills : 6.0

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [17]:
df.loc['k']=['new','1','1','yes']
print(df)
df=df.drop('k')
df

             birds  age visits priority
labels
a           Cranes  3.5      2      yes
b           Cranes    4      4      yes
c          plovers  1.5      3       no
d       spoonbills  NaN      4      yes
e       spoonbills    6      3       no
f           Cranes    3      4       no
g          plovers  5.5      2       no
h           Cranes  NaN      2      yes
i       spoonbills    8      3       no
j       spoonbills    4      2       no
k              new    1      1      yes

             birds  age visits priority
labels
a           Cranes  3.5      2      yes
b           Cranes    4      4      yes
c          plovers  1.5      3       no
d       spoonbills  NaN      4      yes
e       spoonbills    6      3       no
f           Cranes    3      4       no
g          plovers  5.5      2       no
h           Cranes  NaN      2      yes
i       spoonbills    8      3       no
j       spoonbills    4      2       no

**13. Find the number of each type of birds in dataframe (Counts)**

In [18]:
df['birds'].value_counts()

Cranes        4
spoonbills    4
plovers       2
Name: birds, dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [19]:
df=df.sort_values(by='age',ascending=False)
df=df.sort_values(by='visits')
df

             birds  age visits priority
labels
g          plovers  5.5      2       no
j       spoonbills    4      2       no
a           Cranes  3.5      2      yes
h           Cranes  NaN      2      yes
i       spoonbills    8      3       no
e       spoonbills    6      3       no
c          plovers  1.5      3       no
b           Cranes    4      4      yes
f           Cranes    3      4       no
d       spoonbills  NaN      4      yes

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [20]:
df['priority'] = df['priority'].replace({'yes': 1, 'no': 0})
df

             birds  age visits  priority
labels
g          plovers  5.5      2         0
j       spoonbills    4      2         0
a           Cranes  3.5      2         1
h           Cranes  NaN      2         1
i       spoonbills    8      3         0
e       spoonbills    6      3         0
c          plovers  1.5      3         0
b           Cranes    4      4         1
f           Cranes    3      4         0
d       spoonbills  NaN      4         1

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [21]:
df['birds']=df['birds'].replace({'Cranes':'trumpeters'})
df

             birds  age visits  priority
labels
g          plovers  5.5      2         0
j       spoonbills    4      2         0
a       trumpeters  3.5      2         1
h       trumpeters  NaN      2         1
i       spoonbills    8      3         0
e       spoonbills    6      3         0
c          plovers  1.5      3         0
b       trumpeters    4      4         1
f       trumpeters    3      4         0
d       spoonbills  NaN      4         1